In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\parmeet.dang\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\parmeet.dang\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\parmeet.dang\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\parmeet.dang\anaconda3\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in c:\users\parmeet.dang\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: There was an error checking the latest version of pip.

In [2]:
# Data Manipulation library
import pandas as pd

# Create series

series will contains list of similar data types

In [3]:
list1 = [1,2,3,4,5]
s1 = pd.Series(list1)

In [4]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
list1 = ['Parmeet','Varun','Leelakrishna', 'Sree','Trishaan']

In [6]:
s2 = pd.Series(list1,name='Name')

In [7]:
s2

0         Parmeet
1           Varun
2    Leelakrishna
3            Sree
4        Trishaan
Name: Name, dtype: object

In [8]:
type(s1)

pandas.core.series.Series

In [9]:
s1.dtype

dtype('int64')

In [10]:
type(s2)

pandas.core.series.Series

In [11]:
s2.dtype

dtype('O')

In [12]:
s3 = pd.Series((1,2,3,4,5), name ='marks')

In [13]:
s3

0    1
1    2
2    3
3    4
4    5
Name: marks, dtype: int64

In [14]:
s1 + s3

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [15]:
s4 = pd.Series([1,2,3,4,5,6], name='marks1')

In [16]:
s4

0    1
1    2
2    3
3    4
4    5
5    6
Name: marks1, dtype: int64

In [17]:
s3

0    1
1    2
2    3
3    4
4    5
Name: marks, dtype: int64

In [18]:
s3 + s4
0 -> 1+1 = 2
1 -> 2+2 =4
2 -> 3+3 = 6
3 -> 4+4 = 8
4 -> 5+ 5 = 10
5 -> 6 + Nan = Nan -> 6 +0 = 6

SyntaxError: invalid syntax (<ipython-input-18-d77b11f126ac>, line 2)

In [19]:
import numpy as np
type(np.nan)

float

In [20]:
s3.add(s4, fill_value=0)

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5     6.0
dtype: float64

In [21]:
s3.add(s4,fill_value=0)

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5     6.0
dtype: float64

In [22]:
s3.mul(s4)

0     1.0
1     4.0
2     9.0
3    16.0
4    25.0
5     NaN
dtype: float64

In [23]:
s3.div(s4)

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    NaN
dtype: float64

In [24]:
s3.sub(s4)

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    NaN
dtype: float64

In [25]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
s1[0]

1

In [27]:
s1[:3] #[start_index:stop_index:step]

0    1
1    2
2    3
dtype: int64

In [28]:
s1[::2]

0    1
2    3
4    5
dtype: int64

In [29]:
s3.mod(s4)

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    NaN
dtype: float64

In [30]:
s3

0    1
1    2
2    3
3    4
4    5
Name: marks, dtype: int64

In [31]:
s3.sum()

15

In [32]:
s3.cumsum()

0     1
1     3
2     6
3    10
4    15
Name: marks, dtype: int64

In [33]:
s3

0    1
1    2
2    3
3    4
4    5
Name: marks, dtype: int64

In [34]:
s3.aggregate(func = 'mean')

3.0

In [35]:
s3.aggregate(func='sum')

15

In [36]:
s5 = pd.Series([10,20,50,30,60,70,90,30,50,40])
s5

0    10
1    20
2    50
3    30
4    60
5    70
6    90
7    30
8    50
9    40
dtype: int64

In [37]:
# drop duplicates
s5.drop_duplicates()

0    10
1    20
2    50
3    30
4    60
5    70
6    90
9    40
dtype: int64

In [38]:
# drop duplicates
s5.drop_duplicates().reset_index(drop=True)

0    10
1    20
2    50
3    30
4    60
5    70
6    90
7    40
dtype: int64

In [39]:
s5.drop_duplicates().reset_index(drop=True)

0    10
1    20
2    50
3    30
4    60
5    70
6    90
7    40
dtype: int64

In [40]:
# renaming the index
s6 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
s6

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [41]:
# Indexes
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
s6

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [44]:
s6.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [45]:
s1.append(s6)

0    1
1    2
2    3
3    4
4    5
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [46]:
s1.append(s6,ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    1
6    2
7    3
8    4
9    5
dtype: int64

In [47]:
s5 -> to have the upper cutoff as 80 and lower cutoff as 20

SyntaxError: invalid syntax (<ipython-input-47-578ade06984b>, line 1)

In [48]:
s5.clip(20,80)

0    20
1    20
2    50
3    30
4    60
5    70
6    80
7    30
8    50
9    40
dtype: int64

In [49]:
# Creating a series
series5 = pd.Series([[1, 2, 3], 'foo', [], [3, 4]])
series5

0    [1, 2, 3]
1          foo
2           []
3       [3, 4]
dtype: object

In [50]:
1
2
3
Foo
Nan
3
4

NameError: name 'Foo' is not defined

In [51]:
series5.explode(ignore_index=True)

0      1
1      2
2      3
3    foo
4    NaN
5      3
6      4
dtype: object

## DataFrames

In [52]:
dict1 = {'Name':['Parmeet','Trishaan','Anit','Parmeet','Trishaan','Anit'],
         'Age' : [27,12,3,27,12,3],
         'Location' : ['Indore','Mumbai','Bengaluru','Indore','Mumbai','Bengaluru']}

In [53]:
df = pd.DataFrame(dict1) # creating dataframe from dictionary
df

       Name  Age   Location
0   Parmeet   27     Indore
1  Trishaan   12     Mumbai
2      Anit    3  Bengaluru
3   Parmeet   27     Indore
4  Trishaan   12     Mumbai
5      Anit    3  Bengaluru

In [54]:
# first few rows of the dataframe
df.head(2)

       Name  Age Location
0   Parmeet   27   Indore
1  Trishaan   12   Mumbai

In [55]:
# last 2 rows
df.tail(2)

       Name  Age   Location
4  Trishaan   12     Mumbai
5      Anit    3  Bengaluru

In [56]:
# extract the column names from df
df.columns

Index(['Name', 'Age', 'Location'], dtype='object')

In [57]:
# check number of rows and columns in the df
df.shape # (rows,cols)

(6, 3)

In [58]:
print(f'rows:{df.shape[0]}\t cols:{df.shape[1]}')

rows:6	 cols:3

In [59]:
# check the data type of df
type(df)

pandas.core.frame.DataFrame

In [60]:
# etraxt the Name from df # df[column_name]
df['Name']

0     Parmeet
1    Trishaan
2        Anit
3     Parmeet
4    Trishaan
5        Anit
Name: Name, dtype: object

In [61]:
type(df['Name'])

pandas.core.series.Series

In [62]:
# extract the Age columns from df 
df['Age']

0    27
1    12
2     3
3    27
4    12
5     3
Name: Age, dtype: int64

In [63]:
type(df['Age'])

pandas.core.series.Series

In [64]:
# let u check the information about the df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int64
 2   Location  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [65]:
df

       Name  Age   Location
0   Parmeet   27     Indore
1  Trishaan   12     Mumbai
2      Anit    3  Bengaluru
3   Parmeet   27     Indore
4  Trishaan   12     Mumbai
5      Anit    3  Bengaluru

In [66]:
# extract the rows -> second row df.iloc[index_number]
df.iloc[1]

Name        Trishaan
Age               12
Location      Mumbai
Name: 1, dtype: object

In [67]:
df.iloc[4]

Name        Trishaan
Age               12
Location      Mumbai
Name: 4, dtype: object

##### 2 ways to extract the column names one is with Name and another with index number

In [68]:
df[::] # [start_index,stop_index,step]

       Name  Age   Location
0   Parmeet   27     Indore
1  Trishaan   12     Mumbai
2      Anit    3  Bengaluru
3   Parmeet   27     Indore
4  Trishaan   12     Mumbai
5      Anit    3  Bengaluru

In [69]:
# df [rows,cols]

In [70]:
df['Name']

0     Parmeet
1    Trishaan
2        Anit
3     Parmeet
4    Trishaan
5        Anit
Name: Name, dtype: object

In [71]:
df.iloc[0]

Name        Parmeet
Age              27
Location     Indore
Name: 0, dtype: object

In [72]:
# extracting first row location

In [73]:
rows = 0
cols = ['Location']
df.loc[rows,cols]

Location    Indore
Name: 0, dtype: object

In [74]:
rows = 1
cols = 2
df.iloc[rows,cols]

'Mumbai'

In [75]:
df

       Name  Age   Location
0   Parmeet   27     Indore
1  Trishaan   12     Mumbai
2      Anit    3  Bengaluru
3   Parmeet   27     Indore
4  Trishaan   12     Mumbai
5      Anit    3  Bengaluru

In [76]:
cols = ['Name','Age']
df[cols]

       Name  Age
0   Parmeet   27
1  Trishaan   12
2      Anit    3
3   Parmeet   27
4  Trishaan   12
5      Anit    3

In [77]:
cols = ['Location']
df[cols] # df[['location']]

    Location
0     Indore
1     Mumbai
2  Bengaluru
3     Indore
4     Mumbai
5  Bengaluru

In [78]:
type(df[cols])

pandas.core.frame.DataFrame

In [79]:
cols ='Location', 'Name'
df[cols]

KeyError: ('Location', 'Name')

In [80]:
print(type(df[cols]))

KeyError: ('Location', 'Name')

In [81]:
cols =['Name','Age']
df.loc[:,cols]

       Name  Age
0   Parmeet   27
1  Trishaan   12
2      Anit    3
3   Parmeet   27
4  Trishaan   12
5      Anit    3

In [82]:
#df[rows, cols]

df[rows]  -> df[start_index:stop_index:step]
df[cols]  -> df[start_index:stop_index:step]

df.iloc[rows,cols] - > df[SRI:STRI:STEP_ROW , SCI:STCI:STEP_COLS ]

SyntaxError: invalid syntax (<ipython-input-82-2f67562e9f13>, line 3)